% practice07_13.m
%
% $Id: practice07_13.m,v 1.2 2007/05/07 11:09:47 sho Exp $
%
% Copyright (C) 2005-2015 Shogo MURAMATSU, All rights reserved
%

% 9/7変換の分析・合成フィルタのインパルス応答については、
% lifting97.mat に保存している。
% load して、h0, h1, f0, f1 を確認して欲しい。
%
% a = -1.586134342059924;
% b = -0.052980118572961;
% g =  0.882911075530934;
% d =  0.443506852043971;
% K =  1.230174104914001;
%

% 以下は、5/3変換の例　(参考：practice07_13_text.m ）

%% タイプIのポリフェーズフィルタ（分析器）
u00 = 1; u01 = [1 1]/4;
%u10 = 0; u11 = 1;

d00 = [0 1]; %d01 = 0;
%d10 = 0; d11 = 1;

ud00 = conv(u00,d00); ud01 = u01;
ud10 = 0; ud11 = 1;

%p00 = 1; p01 = 0;
p10 = -[1 1]/2; %p11 = 1;

e00 = [ud00 0] + conv(ud01,p10); 
e01 = ud01;
e10 = p10; 
e11 = 1;

%% 分析フィルタ
[e00,e01] = eqtflength(e00,e01); % 長さを揃える
h0 = upsample(e00,2) + upsample(e01,2,1);
h0 = h0(1:end-1); % 最後の零値を取り除く

[e10,e11] = eqtflength(e10,e11); % 長さを揃える
h1 = upsample(e10,2) + upsample(e11,2,1);
h1 = h1(1:end-1); % 最後の零値を取り除く

fvtool(h0,1,h1,1);

%% タイプIIのポリフェーズフィルタ（合成器）
p00 = 1; p01 = 0;
p10 = [1 1]/2; p11 = 1;

d00 = 1; d01 = 0;
d10 = 0; d11 = [0 1];

pd00 = 1; pd01 = 0;
pd10 = p10; pd11 = d11;

u00 = 1; u01 = -[1 1]/4;
u10 = 0; u11 = 1;

r00 = 1;
r01 = u01;
r10 = pd10;
r11 = conv(pd10,u01)+[pd11 0];

%% 合成フィルタ
[r00,r10] = eqtflength(r00,r10); % 長さを揃える
f0 = upsample(r00,2,1)+upsample(r10,2);
f0 = f0(1:end-1); % 最後の零値を取り除く

[r01,r11] = eqtflength(r01,r11); % 長さを揃える
f1 = upsample(r01,2,1)+upsample(r11,2);
f1 = f1(1:end-1); % 最後の零値を取り除く

fvtool(f0,1,f1,1);

% end


